{"name":"##Gladiator Beasts","author":"Raytee","created":"2018-01-20","skill":"Endless Trap Hell","main":[{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Dimacari","amount":1},{"name":"Gladiator Beast Bestiari","amount":1},{"name":"Gladiator Beast Bestiari","amount":1},{"name":"Gladiator Beast Murmillo","amount":1},{"name":"Gladiator Beast Murmillo","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Curse of Anubis","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Michizure","amount":1},{"name":"Wall of Disruption","amount":1},{"name":"Wall of Disruption","amount":1}],"extra":[{"name":"Gladiator Beast Heraklinos","amount":1},{"name":"Gladiator Beast Nerokius","amount":1},{"name":"Gladiator Beast Essedarii","amount":1},{"name":"Gladiator Beast Essedarii","amount":1},{"name":"Gladiator Beast Essedarii","amount":1}],"notes":[{"text":"After the \"Mind Scan Nerf\" was confirmed, I was experementing with different skills. Endless Trap Hell is a pretty good allrounder when it comes to the current meta. \r\nI reduced the monsters to 8 to not brick with a \"Monsters Only\" hand, with ETH as a backup for resources, I can use traps at the start of the game when I have no monsters without having the issue to run out of backrow-resources because of using them to protect myself without having monsters.\r\nIt is also great in the mirror match, to have access to more traps than my opponent, like 3+ Floodgates for example.\r\n(same goes for hazy, when you can consistently floodgate everything they summon, or having the option to use 2 Curse of Anubis)\r\n\r\nI also think that dropping Enemy Controller is a mistake, hazy is not dominating and against almost all other match ups Enemy Controller is a great card in GB's.\r\nI am not playing Super Rush Headlong because of Endless Trap Hell. (to not have a dead skill when I am drawing to many spells)\r\nThe only new card in there is Michizure, after Mind Scan is gone people will not expect a card like this. Super Rush is extremey popular so we can counter that with this tech, sure we lose our monster but we can drag an opponents monster with us, for example an opponents GB or an annoying electro etc. The card is also great in the mirror match when your opponent has one GB and you have two, he will use resources to attack and you simply drag his monster with you by sacrificing one of your monsters.\r\nBut thats it for now, I also have other GB variants that I will use in the next seasons."}],"url":"/top-decks/january-2018/gladiators/gladiator-beasts-by-raytee/"}
