{"name":"##","top-player-council":false,"author":"Allen","created":"2018-03-23","skill":"Destiny Calling","main":[{"name":"Destiny HERO - Celestial","amount":1},{"name":"Destiny HERO - Celestial","amount":1},{"name":"Destiny HERO - Celestial","amount":1},{"name":"Destiny HERO - Decider","amount":1},{"name":"Destiny HERO - Decider","amount":1},{"name":"Destiny HERO - Decider","amount":1},{"name":"Destiny HERO - Drilldark","amount":1},{"name":"Destiny HERO - Drilldark","amount":1},{"name":"Destiny HERO - Drilldark","amount":1},{"name":"Destiny HERO - Dreamer","amount":1},{"name":"Cosmic Cyclone","amount":1},{"name":"Destiny Draw","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Tribute to the Doomed","amount":1},{"name":"D-Fusion","amount":1},{"name":"Destiny Signal","amount":1},{"name":"Mirror Wall","amount":1},{"name":"Xing Zhen Hu","amount":1}],"extra":[{"name":"Destiny HERO - Dangerous","amount":1},{"name":"Destiny HERO - Dangerous","amount":1},{"name":"Destiny HERO - Dangerous","amount":1}],"notes":[{"text":"The original decklist had 3 cosmic cyclones, 2 destiny callings, and 2 d-fusions. Unfortunately I didn't have 3 cyclones, so I had to make some adjustments. D-fusion is too slow and there's too many ways to get around d-signal, so I reduced them both to 1.\r\nIn games where I don't start out with cyclone, I let the opponent attack me directly on their first turn (if I have econ, I set it). It sounds risky, but I've never had trouble bringing out Destiny Calling doing this. Also, econ is your playmaker, it's one of your most important cards. If you don't need to use econ, don't use it.\r\nAgainst nearly every matchup, you want to be playing super aggressively. Even if you don't have Destiny Calling yet you want to be aggressive. The deck has insane OTK potential with drilldark, econ, and D-fusion. Tribute to the doomed has been amazing for me because it helps for OTKs, removing cards over 2600, and setting up celestial's draw effect. xzh is interchangeable with other backrow removal. It's situational, but it's won me some games. I've consistently beaten meta decks like Aliens and SSA. They require more thinking, but they're definitely winnable matchups. The only matchup I'd say that this deck loses to is burn. Other than that though, it's an easy KOG, and it's a good deck if you're looking to quickly climb. I've played a ton of different types of D-hero decks, including fusion, but dark city has been most successful for me."}],"url":"/top-decks/march-2018/destiny-heroes/-by-allen/"}
