{"name":"Strong independent women","top-player-council":false,"author":"ZeroPatience","created":"2018-05-05","skill":"Restart","main":[{"name":"Amazoness Queen","amount":1},{"name":"Amazoness Paladin","amount":1},{"name":"Amazoness Swords Woman","amount":1},{"name":"Amazoness Swords Woman","amount":1},{"name":"Amazoness Swords Woman","amount":1},{"name":"Amazoness Princess","amount":1},{"name":"Amazoness Princess","amount":1},{"name":"Amazoness Princess","amount":1},{"name":"Amazoness Baby Tiger","amount":1},{"name":"Amazoness Baby Tiger","amount":1},{"name":"Cosmic Cyclone","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Forbidden Chalice","amount":1},{"name":"Amazoness Onslaught","amount":1},{"name":"Amazoness Onslaught","amount":1},{"name":"Amazoness Onslaught","amount":1},{"name":"Amazoness Willpower","amount":1},{"name":"Amazoness Willpower","amount":1}],"extra":[],"notes":[{"text":"I went 8 straight from platinum to legend with my Geargia build that got me to kog last season. After playing Geargia in legend for a while (and continuously having my monsters blown up by Sylvans, Archfiends and Masked Heroes running treacherous trap hole) I decided to shift to my Masked Heroes deck. I had more success with them and got to legend 2 only to have my internet die out on me every two matches. This shouldn’t come as a surprise, but winning 2 matches and losing 3 matches due to d/c losses tends to be counterproductive.\r\n\r\nI got my internet up and running again by yesterday and got my hands on 5 Amazoness Princess’ during my first couple of farms. So I decided to run an Amazoness deck for the giggles. With success. I got to kog in 22 wins after shifting to this deck\r\n\r\nThis deck is really strong at the moment. Masked Heroes were free wins every single time. Sylvans were a more difficult match-up. Archfiends were losses 2 out of 3 times. Sylvans with godlike mills also managed to kick me out of my rank-up so there’s that also. The only thing I changed about the deck was taking out sage for a second Baby Tiger and one chalice for a cc. This is by far the most fun deck I've ever used to reach kog\r\n\r\nMy last five matches were:\r\n\r\n#1) Grit Sylvans: I managed to go first and forced him on the offensive, causing him to lose steam quickly\r\n#2) Grit Silvans: He got bad mills and I ended up banishing all his resources\r\n#3) Restart Amazoness: Legend 3 player also, felt kinda bad about beating him. He went first. I outplayed/out resourced him right of the bat turn 2. One-sided match by the end of my first turn \r\n#4) Reinforcements Masked Heroes: He ran Snipe Hunter and blew up my monsters, only for him to blow my onslaught up afterwards. Leaving himself with no cards in hand and wide open\r\n#5) Restart Masked Heroes: Banished his monsters and he ended up suiciding into me with dreamer. Pretty anti-climactic rank-up"}],"url":"/top-decks/may-2018/amazoness/strong-independent-women-by-zeropatience/"}
