{"name":"Sacky Psychics","author":"Whybona","created":"2018-02-02","skill":"Firm as the EARTH","main":[{"name":"Destructotron","amount":1},{"name":"Reinforced Human Psychic Borg","amount":1},{"name":"Reinforced Human Psychic Borg","amount":1},{"name":"Reinforced Human Psychic Borg","amount":1},{"name":"Serene Psychic Witch","amount":1},{"name":"Serene Psychic Witch","amount":1},{"name":"Serene Psychic Witch","amount":1},{"name":"Power Injector","amount":1},{"name":"Power Injector","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Psychokinesis","amount":1},{"name":"Psychokinesis","amount":1},{"name":"Psychokinesis","amount":1},{"name":"Super Rush Headlong","amount":1},{"name":"Super Rush Headlong","amount":1},{"name":"Curse of Anubis","amount":1},{"name":"Wall of Disruption","amount":1},{"name":"Wall of Disruption","amount":1}],"extra":[],"notes":[{"text":"Built the deck to be as aggressive as possible and put as much early pressure on as possible with Destructotron so that I could then make reads on the single backrow they played each turn (if any at all) and win with my bigger monsters (thanks to the field spell). The key to doing well with this was definitely reading backrow successfully, especially with WoD being really common right now and swinging into a WoD at a bad time is devastating. Used 3 Borgs since it's a 2k beater under the field spell meaning that it's not as bad opening with it as it would be using other skills. WoD and econs are there for CA as well as econ being great for putting on the offensive pressure and providing potential to OTK after clearing backrow with a special summoned Destructotron. Curse of Anubis is pretty much a staple in most backrow heavy decks imo and SRH is great against GBs and ensuring you can make your big push after using Destructotron even if they used SRH to try to defend themselves, it's also pretty important since the whole deck is earth monsters so SRH can block out a full front row of monsters."}],"url":"/top-decks/february-2018/psychics/sacky-psychics-by-whybona/"}
