{"name":"Maximus Decimus Meridius","author":"TitusAureliusX","created":"2018-01-06","skill":"Balance","main":[{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Dimacari","amount":1},{"name":"Gladiator Beast Dimacari","amount":1},{"name":"Gladiator Beast Bestiari","amount":1},{"name":"Gladiator Beast Bestiari","amount":1},{"name":"Gladiator Beast Murmillo","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Forbidden Chalice","amount":1},{"name":"Forbidden Chalice","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Wall of Disruption","amount":1},{"name":"Wall of Disruption","amount":1}],"extra":[],"notes":[{"text":"“My name is Maximus Decimus Meridius. Commander of the armies of the North, general of the Felix Legions, loyal servant to the true emperor Marcus Aurelius. Father to a murdered son, husband to a murdered wife, and I will have my vengeance in this life or the next.” - Gladiator\r\n\r\nClimbed to Legend 3 spreading bamboo cancer but couldn’t seem to spread it all the way to KOG so ended up changing over to Gladiators when I fell to Legend 2.\r\n\r\nTried different builds until I ended up reaching KOG with the one here. Chalices, ECONs, and Floodgates all served as chemo for bamboo cancer, cyber cancer, and ninja cancer. \r\nWorst match up was 3SD Hazy unless you managed to floodgate their first summon and they didn’t have beast rising. \r\nSecond worst was AG if they got field control early on since they could prevent battle phase spell/trap activation and usually had sergeant elctro too.\r\nInteresting match ups were the different burn and mill decks. Faced DDraw burn, Weevil burn, ExtraExtra Mill, and even Exodia burn (who knew this was a thing). MVPs for non-Weevil burn match ups were floodgate and chalices to prevent direct attacks and clog their field. Life saving combo to recover from getting Lava Golemed before realizing the deck they played was to attack one of their set monsters and activating impenetrable attack on THEIR monster so you could ECON tribute once it’s face up. Also if you have sufficient counters to their direct attacks and realize you won’t be able to kill them through attacking you could choose to instead mill them out with the 2 gladiator contact fusion. This route is a lot more tedious but it guaranteed me the win a majority of the time.\r\n\r\nIn conclusion, I enjoyed finishing off my climb with gladiator-beasts. I felt more secure playing them than I had with bamboo cancer and never fell down to Legend 2 after I ranked back up to Legend 3. I would’ve run 3 floodgates if I had them and was considering running a 3rd chalice."}],"url":"/top-decks/january-2018/gladiator-beasts/maximus-decimus-meridius-by-titusaureliusx/"}
