[
  {
    "name": "Toon Barrel Dragon (With Toon Kingdom Up) - Unmovable Walls",
    "image": "https://i.imgur.com/8gzo8NK.png",
    "reason": "Toon Barrel Dragon with Toon Kingdom up, is the combo to beat right now in the meta. Toon Kingdom prevents you from targeting TBD, so even powerful cards like BDN cannot remove them from the field. Couple the fact that it has a per-turn card removal and a beefy 2600 attack with 2200 defense; it the T-2000 from Terminator. The only way to deal with TBD, is if you have BDN on the field and have the removal fuel necessary, WHEN TK is not on the field. The necessary steps to remove TK, then remove TBD, may be too much for one turn."
  },
  {
    "name": "Psychokinesis - Trap Destruction",
    "image": "https://i.imgur.com/hKAdL3c.png",
    "reason": "Psychics as an archetype is a good counter to 3SD ninjas. Borg can get really big and annoying cards like Wattpsychic can control the 3SD ninja. But the main problem is Psychokinesis. Its ability to not only destroy the monster, but the traps is an issue for 3SD ninjas. BDN needs instant remove any psychics, before they can start firing off that spell. Annoyingly, after you deal with the psychic monster/psychokinesis, they still have cards like Mirror Wall, Enemy Controller, and SRH. And they don’t set monsters, except for Serene."
  },
  {
    "name": "Electro Control - Lockdown of Traps/Slow Roll",
    "image": "https://i.imgur.com/VzNtgu4.png",
    "reason": "Much like psychokinesis and TBD, Sergeant Electro ability to tap down the face-down traps is a real hindrance to ninja players. They are often found in control decks, hazy deck, even the 3SD Toon Barrel Dragon deck. When paired with good backrow protection or another bigger monster, electro really stops ninjas from going off. Control Decks are good against ninjas, because of cards like Electro and their backrow. It’s too much problems that needs answering with limited amount of time/resources. Then they just snowball."
  },
  {
    "name": "Champion's Vigilance - Negation of Summoning / Swarming / Traps",
    "image": "https://i.imgur.com/uF8xMid.png",
    "reason": "Much like the problem proposed by Venus OTC Shine Balls, Champion Vigilance or any counter trap, such as Naturia’s Fang or Ultimate Providence, is a major problem for ninja. Negation of the trap isn’t too bad of an issue, is the destruction of the monster following the negation. Because 3SD ninjas typically only have one monster on the board, stopping that one monster from ever hitting the board OR swapping out, typically means game for the ninja player. But then again, what deck doesn’t fold to first turn CV sets."
  }
]