  [
  {
      "name": "Sphere Kuriboh",
      "amount": "2",
      "description": "When an opponent’s monster declares an attack: You can send this card from your hand to the GY; Change the attacking monster to Defense Position. When you Ritual Summon a monster, you can Banish this card from your Graveyard as 1 of the Monsters required for the Ritual Summon.",
      "set": "WTG: Ultimate Rising Pack [UR]",
      "image": "https://i.imgur.com/wS1cCB8.png",
      "why": "Currently Sphere Kuriboh is the only hand trap available in the game. It is still one of the best defensive cards in game. Also, your backrow is really clogged with traps. Kuriboh can also be used in the event your backrow is wiped by something like Phoenix. I ran 2, and I wouldn’t run more or less."
  },
  {
      "name": "Ninja Grandmaster Sasuke",
      "amount": "2",
      "description": "At the start of the Damage Step, if this card attacks a face-up Defense Position monster: Destroy that monster.",
      "set": "WTG: Electro Overload Pack [SR]",
      "image": "https://i.imgur.com/suM8Rnv.png",
      "why": "Sasuke provides good stats and transformation target. His effect also comes in handy after a windstorm OR kuriboh. But seeing as how this is the 3SD version, he isn’t the main star. I ran 2 of them, because they gave you something to play after you spent your 3SD skill. He isn’t mandatory, but he helps."
  },
  {
      "name": "Black Dragon Ninja",
      "amount": "3",
      "description": "Cannot be Special Summoned, except with the effect of a “Ninja” monster or “Ninjitsu Art” card. Once per turn, during either player’s turn: you can send 1 “Ninja” monster and 1 “Ninjitsu Art” card from your hand and/or face-up from your field to the GY, then target 1 monster on the field: banish it. If This face-up card leaves the field: Special Summon as many monsters banished by this card’s effect as possible to their owner’s field(s).",
      "set": "WTG: Electro Overload Pack [R]",
      "image": "https://i.imgur.com/UmasmfV.jpg",
      "why": "The star of the show! He is arguably one of the most powerful card in game right now. He is a strong 2800 attacker with instant removal and serves as a Launchpad for this deck! A lot of players just do not understand the possibility available with BDN. You need 3 of them, and there is no substitute for him in this deck. He deserves his own section below."
  },
  {
      "name": "Red Dragon Ninja",
      "amount": "3",
      "description": "When this card is Summoned: You can banish 1 \"Ninja\" or \"Ninjitsu Art\" card from your Graveyard to target 1 Set card your opponent controls; reveal that Set card, then return it to either the top or bottom of the Deck. Your opponent cannot activate the targeted card in response to this effect's activation. You can only use the effect of \"Red Dragon Ninja\" once per turn.",
      "set": "WTG: Dawn of Destiny [R]",
      "image": "https://i.imgur.com/2qtpbxY.jpg",
      "why": "The co-star to BDN! You also need 3 of these guys! They serve as the main control portion of the deck. A powerful ability to spin cards to either the top or bottom of the deck, controlling your opponents field AND draw in one go. He is your key to starting the offensive and dealing with pesky MILL decks! Note: DO NOT activate his ability during a chain, you will mistime and not get his effect!"
  },
  {
      "name": "Armed Ninja",
      "amount": "2",
      "description": "FLIP: Target 1 Spell Card on the field; destroy that target. (If the target is Set, reveal it, and destroy it if it is a Spell Card. Otherwise, return it to its original position.)",
      "set": "WTG: All legendary duelists level 30 or less",
      "image": "https://i.imgur.com/7Huc0YB.jpg",
      "why": "With the current meta trending towards spell heavy backrow protection, armed ninja is a way to deal with pesky Super Rush, Enemy Controller, and even the infamous Toon Kingdom. When your opponent ends turn, you can duplication into armed ninja and another ninja for a next turn setup! ALSO, he is fuel for BDN. So I ran 2 of them!"
  },
  {
      "name": "Ninjitsu Art of Transformation",
      "amount": "3",
      "description": "Activate this card by Tributing 1 face-up \"Ninja\" monster; Special Summon 1 Beast, Winged Beast, or Insect-Type monster from your hand or Deck whose Level is less than or equal to the Level the Tributed monster had on the field +3. When this card leaves the field, destroy that monster.",
      "set": "WTG: Electric Overload [UR]",
      "image": "https://i.imgur.com/XexQmRd.png",
      "why": "One of the key traps in the deck, it launches your combo! It also serves as a primary dodge for your ninja to escape targeting effects, such as enemy controller. Transformation allows you to go from BDN to RDN, RDN to BDN, and anything in between. It also works off Sasuke. I ran 3, you need all 3, there is no substitute…sorry."
  },
  {
      "name": "Windstorm of Etaqua",
      "amount": "1",
      "description": "Change the battle positions of all face-up monsters your opponent controls.",
      "set": "WTG: Mai Valentine level 25 Reward [R]",
      "image": "https://i.imgur.com/I79aoZO.png",
      "why": "Still one of the best defensive/offensive cards in the game! Universal application, unlike curse of Anubis, you can hit everything and also, change defense monsters into attack position for some offense. Its mandatory, because it gives you protection in case something doesn’t go your way."
  },
  {
      "name": "Ninjitsu Art of Shadow Sealing",
      "amount": "1",
      "description": "Tribute 1 \"Ninja\" monster to target 1 monster your opponent controls; banish that target. While that card is banished, its Monster Card Zone cannot be used. When this face-up card leaves the field: Return the card banished by this effect to the same Monster Card Zone, in the same battle position.",
      "set": "WTG: Dawn of Destiny [N]",
      "image": "https://i.imgur.com/V3sJVJ4.png",
      "why": "Quite honestly the effect isn’t worth the cost, but its BDN fuel as well. It can be good in some situation such as “Armed Ninja” as a tribute, just to pin away a Red Eyes or a Toon Barrel Dragon. I only ran 1 because I don’t think an additional one will offer much value over the other cards."
  },
  {
      "name": "Ninjitsu Art of Duplication",
      "amount": "3",
      "description": "Tribute 1 \"Ninja\" monster; Special Summon any number of \"Ninja\" monsters from your Deck, in face-up Attack Position or face-down Defense Position, with combined Levels less than or equal to the Level of the Tributed monster. When this card leaves the field: Destroy those monsters.",
      "set": "WTG: Electric Overload [N]",
      "image": "https://i.imgur.com/mSMwfut.png",
      "why": "The second most important trap in the deck! Much like transformation, this card allows you to go into many different combos (which I’ll explain later). It helps you get your multiple attack, dodge, and find answers to different situations. You need 3 of these cards, because it is your 2nd set of transformation. Lucky it’s an N."
  }
]