[
  {
    "name": "Mill",
    "image": "https://i.imgur.com/fdqxExN.jpg",
    "reason": "Honestly, one of the easiest match-up. They don’t attack and they set everything. So RDN always just spins away their monsters. Then trap cards just as feint plan are useless. They will sometimes just Assault GHQ their monster away, which doesn’t affect ninjas too much. The burst potential of ninja never lets them rest. As soon as the field is clear, you can go all way inside on them. Sometimes Jowl can be a pain, so be cautious. Overall, the match-up is extremely favorable, rarely lose. "
  },
  {
    "name": "Red-Eyes B. Dragon",
    "image": "https://i.imgur.com/hPvwxgQ.png",
    "reason": "Some people may find this surprising, but this deck has no trouble handling the King right now. This is due to BDN higher attack and instant removal. Even Beatdown Boosted REBD cannot take BDN down. Most REBD/REZD deck don’t run additional S/T for protection, aside from Mirror Wall, because all their S/T is occupied by 3 insight and 3 spirit. So you just have to slow roll them. Don’t attack until those mirror wall is gone. RDN is also keep in sending spirit to the bottom of the deck, leaving them nothing to summon. Also, BDN banish effect will not allow them to use spirit. Overall, another favorable to extremely favorable match up."
  },
  {
    "name": "Sacred Phoenix of Nephthys",
    "image": "https://i.imgur.com/HieYKBX.png",
    "reason": "Originally I thought this would be a bad match-up, but since I removed all the Senior Silver Ninja, the match-up has become way more favorable. Opening Armed Ninja or Sasuke is not too bad against phoenix, because you can either go head-to-head with Yaksha. Or they destroy your Armed Ninja, which will allow you to destroy their Fire King Island. BDN is bigger than phoenix and does not require transformation. Instant Removal as allow you to banish phoenix, preventing it coming back to destroy S/T. Hane and Gale Lizard can be annoying, but RDN can be your answers. I would say depends on your draw, but in most cases it’s slightly more favorable for Ninja due to the Fire King Island play leaving their field open for burst."
  },
  {
    "name": "Ninjas (Non 3SD)",
    "image": "https://i.imgur.com/suM8Rnv.png",
    "reason": "Honestly, any other version of ninja feels really weak now. Their reliance on setting traps such as transformation, for their lower level ninja monster is too slow in comparison to 3SD version. RDN controls the board, not allowing stuff like transformation or white ninja to go off. Beatdown boosted Flame Armor Ninja is no threat. Even worse it the mind scan version, they are too slow right now. 3SD can go into RDN or BDN without transformation or tribute."
  },
  {
    "name": "Ice Barrier",
    "image": "https://i.imgur.com/BDKybZZ.png",
    "reason": "Ice barriers tendency to pass on first turn due to need the three monster and triangles, suffer a similar problem that Phoenix has. The burst potential especially if you draw into BDN with 1 trap and 1 ninja is instant-kill. However, if the ice barrier can survive and RMB to target the traps (not the monster), then they have a good chance (depending on the monsters they have). BDN is still a huge check, since they can self-dodge, removal their big monsters, or attack replay. All in all, favorable match-up for Ninjas because of burst potential."
  },
  {
    "name": "Gravekeepers",
    "image": "https://i.imgur.com/XYbfANV.png",
    "reason": "I didn’t face many on the way to KoG, but the match-up is favorable due to two primary reason: they typically set recruiter face-down and the operate off soul exchange/enemy controller. RDN spins away recruiter and enemy controller. Soul Exchange is dodged through traps or BDN effect. Monsters are relatively small in comparison, and they don’t have additional utility. Extremely favorable match-up."
  },
  {
    "name": "Mako Hammer Shark",
    "image": "https://i.imgur.com/T71vicn.png",
    "reason": "Faced a few Makos, the traps were annoying to deal with, but you just have to be patient. Face-down monster is typically yomi ship, so don’t attack. Spell/Traps can vary. Lost Blue Breaker and Deep Sweeper can deal with your traps, but 3SD has the benefit of summoning without traps. Monster are typically smaller unless Star-Boy Boosted. All in all, it’s a toss-up, can go either way. You must out resource the Mako and not attack without proper control their backrow."
  },
  {
    "name": "Weevil",
    "image": "https://i.imgur.com/Sw32jjK.png",
    "reason": "This is where having playable monsters that don’t need 3SD skill to use it really helpful. Weevil can easily cause 1k worth of burn damage to you, whether it be Lava Golem, Parasites, 2 Burning Land, and much more. So, in this situation, wait for them. Chance are they will play passive and not attack. Tribute into your RDN or BDN instead of using the skill. Once you can control their monsters, the spells/traps don’t mean much, because you can dodge into another ninja. Do note, do not crowd the board unless you have game, because they can go into Lava Golem. And unlike your ninjas, you cannot dup or trans him out. All-in-all, a favorable match-up."
  },
  {
    "name": "Relinquished",
    "image": "https://i.imgur.com/TPffTJM.png",
    "reason": "Can be a real problem if you do not draw into traps or BDN. Other than that, it’s very favorable for the ninja. Relinquished effect targets, so we can dodge when it does. They may have a kuriboh or Interdimensional Matter Transporter, but we can still get in multiple attacks to kill their relinquished. Also, keep in mind ritual summoning is resource intensive, keeping one relinquished can typically mean game, because it is hard for them to recover."
  },
  {
    "name": "Toons",
    "image": "https://i.imgur.com/yr49Gy7.png",
    "reason": "The normal version (no 3SD Barrel Dragon) is favorable for the ninja players. Duplication allows you to go into 2 Armed Ninja, which allows you to destroy Toon Kingdom, even though they used a magic reflector. Toons cannot attack first turn (except Toon Dark Magician Girl), so sometimes setting an Armed Ninja is also equally effective. But if they have Toon DMG AND you do not have any duplication/armed ninja, it is goodnight for the ninja player. Chance are that will not happen often, because you have 2 Armed ninja and 3 Duplication in a 20 card deck."
  },
  {
    "name": "Mausoleum",
    "image": "https://i.imgur.com/MaUMKc3.png",
    "reason": "Mausoleum Fiends are troublesome depending on your draw. If you have too much traps and they open with Feng Huang, it can be a problem. If your BDN has no banish fuel or protection for Invader of Darkness, you can lose very quickly. Their face-downs are typically aegis of gaia, but once you control their Invader of Darkness there is no really coming back. Do keep in mind, they can Destiny Draw into a Lava Golem, so try not to crowd your board, unless you know you can game. A toss-up, can go either way."
  },
  {
    "name": "Naturia",
    "image": "https://i.imgur.com/lFJond1.png",
    "reason": "I thought the match-up will be favorable, but it is a coin toss. Naturia’s ability to quickly swarm, but also have decent backrow like SRH and Mirror Wall is a problem. The monsters aren’t huge, but because they can often times get 2 5*+ out, the beatdown effect allows stag beetle to be bigger than BDN. Surprise Naturia tech card, such as Naturia’s Fang is also troublesome, as it stops your combos from going and probably remove your one and only important monster. They also don’t set monsters often. But it largely depends on their draw as well, he they drew into pumpkins and marron, it is goodnight for them. "
  },
  {
    "name": "Venus",
    "image": "https://i.imgur.com/wrQ3cgM.png",
    "reason": "Venus challenges what make ninja’s good; protection, swarming, and versatility. If we go first, we can set up properly, so that we can respond to the Order to Charges and Venus plays. But if they go first, after properly setting up their field with Shine Balls, it’s almost like they have CV. As soon as a ninja hits the field, they can OTC, if not they probably take an attack to the face. But they aren’t worried, my traps won’t be active till next turn. If they have Order to Smash, they can clear my traps and leave my ninja open to another OTC/E-Con or whatever. Luckily, they need a good hand to pull these combos off and their inconsistency prevents them from being a top deck in this meta."
  }
]