[
	{
		"priority": "1",
		"role-id": "admin",
		"role-name": "Admin",
		"group-id": "admin",
		"group-name": "Admin",
		"url": "",
		"color": "#FF1B2B",
		"description": "People with this role provide leadership and organization to the site. They determine the priority of functionality, articles and various structures to how the site is built and maintained."
	},
	{
		"priority": "2",
		"role-id": "top-player-council",
		"role-name": "Top Player Council",
		"group-id": "top-player-council",
		"group-name": "The Top Player Council",
		"url": "/top-player-council/",
		"color": "#315FF5",
		"description": "The Top Player Council is comprised of several members that have shown over a period of time their continued high performance in various tournaments that they have the ability to provide keen insight on various cards, skill, deck types, etc. dealing with the meta of the game. This group is heavily involved in maintaining the tier list and providing feedback various game changes."
	},
	{
		"priority": "3",
		"role-id": "deck-type-expert",
		"role-name": "Deck Type Expert",
		"group-id": "deck-type-experts",
		"group-name": "The Deck Type Experts",
		"url": "",
		"color": "#3498DB",
		"description": "These people have proven themselves in one form or another that have insight on a particular deck type. They've reached King of Games (KoG) several times with this deck type, have topped several tournaments with it and have most likely developed an introduction (or in-depth) guide of that deck type."
	},
	{
		"priority": "4",
		"role-id": "developer",
		"role-name": "Developer",
		"group-id": "developers",
		"group-name": "The Dev Team",
		"url": "/the-dev-team/",
		"color": "#A91B53",
		"description": "This group of people builds and maintains all functionality on the website. At times, they may contribute to various content on the site, but their main role is maintenance and addition to its structure."
	},
	{
		"priority": "5",
		"role-id": "content-manager",
		"role-name": "Content Manager",
		"group-id": "content-managers",
		"group-name": "The Content Managers",
		"url": "",
		"color": "#2ECC61",
		"description": "Content managers provide supervision over all content produced on this website. This includes articles, guides, news reports, etc. If there are any content based issues with the site, they are the first to process it and either address it themselves or assign/research the proper channels."
	},
	{
		"priority": "6",
		"role-id": "content-editor",
		"role-name": "Content Editor",
		"group-id": "content-editors",
		"group-name": "The Content Editors",
		"url": "",
		"color": "#96FC3F",
		"description": "Content editors develop the initial research for developing a post (i.e. article, guide, etc.) They gather the content from various sources, develop an article and submit it to their manager for review and uploading."
	}
]