{"name":"Harpies","author":"Ninja","created":"2018-02-25","skill":"Harpies' Hunting Ground","main":[{"name":"Swift Birdman Joe","amount":1},{"name":"Cyber Harpie Lady","amount":1},{"name":"Cyber Harpie Lady","amount":1},{"name":"Cyber Harpie Lady","amount":1},{"name":"Harpie Dancer","amount":1},{"name":"Harpie Dancer","amount":1},{"name":"Harpie Dancer","amount":1},{"name":"Sphere Kuriboh","amount":1},{"name":"Sky Scout","amount":1},{"name":"Sky Scout","amount":1},{"name":"Big Bang Shot","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Divine Wrath","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Powerful Rebirth","amount":1},{"name":"Powerful Rebirth","amount":1},{"name":"Wall of Disruption","amount":1},{"name":"Wall of Disruption","amount":1}],"extra":[],"notes":[{"text":"I tried various decks but i'd always fail to leave Legend 1 by one match. So, i started browsing through my card collection for something new i remebered that i casually had gotten 3 Harpie Dancers and decided to try Harpies. Went from Legend 1 to KoG with the girls.\r\n\r\nAt first, i also started playing the deck because i wanted to play Ties of the Bretheren, which i placed as a one of. BUT, when it appeared in my hand, either i couldn't afford to not attack, or it wouldn't be smart to pay the 2K LP, or i was playing against Burn and it would be Lava Golem bait (in addition to the 2K LP cost) or simply i already had two monsters on the field so i couldn't activate it. I DO BELIEVE THE CARD IS GOOD ON HARPIES, but this current meta has burn everywhere and quick beatdowns and victories before your opponent can setup his field and plays are super valuable and it's very hard to afford a turn of not attacking.\r\n\r\nBig Bang Shot had its utility but its inclusion in the deck is debatable: it's an easy banish that can help you overcome threats you can't run over with conventional means (by \"threats\", for example, we have Ancient Gear Golem and by \"conventional means\" read \"by battle\") but it's very situational and you don't really benefit from the attack boost and piercing damage on your own monsters (if anything, you get Cosmic Cyclone'd )\r\nAgainst the new Water decks and Aliens:\r\n\r\n>They put pressure on the Water decks because often what they do turn one is summon one monster, activate The Legendary Ocean and set Sea Stealth Attack. If they aren't retarded, they will activate SSA at the start of the turn (if they are retarded, goodbye SSA) and now they are in a pseudo 50/50 situation: let SSA die to HHG or take a direct attack (and they often choose the latter). \r\nIf i draw Swift Birdman Joe, he doesn't care about SSA's protection and bounces it back (which can be even more explosive if you manage to set up its Tribute Summon with Dancer's effect, which means that they probably banished a monster to protect from HHG's destruction). \r\nThe Divine Wrath is my favorite tech card in any deck and it was put to good use here too because Citadel Whale tributes two monsters as a COST, meaning Divine Wrath negates the summon and cleared two monsters on the field with just one discard!\r\n\r\n>Vs Aliens, Dancer easily removes counters from any of your monsters, reduces A-Cell Recombination Device's utility (and you remove the placed counters with Dancer) and shits on Brainwashing Beam. \r\nDivine Wrath, once again, can be very disruptive and Powerful Rebirth is a pseudo counter-cleaning tool. Only issue is that Telepath is a bigger threat than in any other Alien matchup because your \"win-con\" is literally a single, unrecoverable Field Spell.\r\nAlso, USE THE GENERAL GAMEPLAY SURVEY TO ASK KONAMI TO REVERT THE HARPIE'S HUNTING GROUND NERF, PLEASE!"}],"url":"/top-decks/february-2018/harpies/harpies-by-ninja/"}
