{"name":"P2W WHALE WARZ","author":"Blucfr","created":"2018-02-20","skill":"Restart","main":[{"name":"Citadel Whale","amount":1},{"name":"The Legendary Fisherman II","amount":1},{"name":"The Legendary Fisherman II","amount":1},{"name":"The Legendary Fisherman II","amount":1},{"name":"B.E.S. Crystal Core","amount":1},{"name":"B.E.S. Crystal Core","amount":1},{"name":"B.E.S. Crystal Core","amount":1},{"name":"Warrior of Atlantis","amount":1},{"name":"Warrior of Atlantis","amount":1},{"name":"Warrior of Atlantis","amount":1},{"name":"Abyss Soldier","amount":1},{"name":"Abyss Soldier","amount":1},{"name":"A Legendary Ocean","amount":1},{"name":"A Legendary Ocean","amount":1},{"name":"A Legendary Ocean","amount":1},{"name":"Sea Stealth Attack","amount":1},{"name":"Sea Stealth Attack","amount":1},{"name":"Sea Stealth Attack","amount":1},{"name":"Wall of Disruption","amount":1},{"name":"Xing Zhen Hu","amount":1}],"extra":[],"notes":[{"text":"First! Hahahaha\r\nTL:DR\r\nThis deck is amazing but CA and Cosmic Cyclone can cuck you so bad if you dont setup first turn.\r\nBest starting hand is (ALO, SSA, XZH, and either crystal or fisherman)\r\nAbyss Soldier is a great addition, but not necessary.A lot of people are running all kinds of trash lvl5 water monsters. Trust me just use B.E.S. Crystal Core .\r\nBes CC lets you stall for a turn or two until you get SSA.\r\nAnd once SSA is on the field, BESCC doesn't use up counters when battling because it never actually battles, it just destroys at start of damage step. does not protect against SRH HOWEVER, if you do banish CC, when it returns it will have zero counters. It will still be able to destroy stuff with SSA but if you attack directly it dies.(bearbeitet)\r\nThis deck on Glads, AG, Plants, and Dinos. REZD is a tricky matchup but not too bad.\r\nIf you are matched up with Burn, make sure to banish a monster to avoid LG. Also, to the guy who cucked me out of my Leg2 rankup with Chazz Ojama Go Burn... dont let that cancer leak into the meta plz.\r\nSSA is sooooooo strong, it's basically a nonstop SRH. Dont be afraid to be aggressive with SSA on the field since you can banish to reset your monsters' attack if you run into a WOD. Banish with reckless abandon. You'll be fine.\r\nIt also protects ALO and SSA from being blownup by glads and Phoenix. One thing to note in mirror match: both monsters dies if both have SSA. Also, SRH beats SSA in priority somehow so watchout for that!\r\nLegendary Fisherman doesn't care about ebola or blackbrac or any of the Sixsams\r\nIf you get the big out somehow, and you have SSA and ALO on board its GG, barring a late game dakini\r\nHope this helps!!! Message me if you are clueless\r\nI USED THIS DECK ALL THE WAY FROM PLAT 1"}],"url":"/top-decks/february-2018/sea-stealth-attack/p2w-whale-warz-by-blucfr/"}
