{"name":"Hazy Baby","author":"Yami Hammy","created":"2018-02-14","skill":"Aroma Strategy","main":[{"name":"Hazy Flame Cerbereus","amount":1},{"name":"Hazy Flame Cerbereus","amount":1},{"name":"Hazy Flame Cerbereus","amount":1},{"name":"Hazy Flame Sphynx","amount":1},{"name":"Hazy Flame Sphynx","amount":1},{"name":"Hazy Flame Sphynx","amount":1},{"name":"Flame Tiger","amount":1},{"name":"Caninetaur","amount":1},{"name":"Caninetaur","amount":1},{"name":"Soul Exchange","amount":1},{"name":"Soul Exchange","amount":1},{"name":"Soul Exchange","amount":1},{"name":"Beast Rising","amount":1},{"name":"Beast Rising","amount":1},{"name":"Beast Rising","amount":1},{"name":"Curse of Anubis","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Hazy Glory","amount":1},{"name":"Wall of Disruption","amount":1}],"extra":[],"notes":[{"text":"I used this deck to reach DLv MAX in the KC Cup and exclusively for my KoG run (both on the same day)!\r\n\r\nIn the KC Cup, I subbed Wall of Disruption for Divine Wrath to better counter Gladiators which also helped against Sphere Kuriboh as well as in the mirror match (and Beatdown variant). \r\n\r\nOn my Legend 3 climb, I mostly faced Dino decks and CAffira. I won most games against both decks. Dinos run heavy backrow hate so I'd always activate Beast Rising(BR)/Hazy Glory (HG) in my opponents Draw Phase so it wouldn't get pinned by Gyokkou. Alternatively, if you have both BR and HG set and your opponent used Gyokkou, you can chain your face down and then chain what they targeted - so they effectively waste a Gyokkou and clog their own backrow. \r\n\r\nAgainst CAffira you ideally want to go second and open with Soul Exchange and a Hazy monster so you can tribute the Dakini/Saffira they summoned. Floodgate, Wall of Disruption and Curse of Anubis all help a lot in this matchup.\r\n\r\nMy 5 games to KoG were pretty relaxed. 2 Dinos, 1 CAffira, 1 Six Sams and 1 Ghostrick Astral/Spirit Barrier (so glad they didn't get the combo off!) \r\n\r\nGood luck to everyone in the KC Cup!"}],"url":"/top-decks/february-2018/hazy-flame/hazy-baby-by-yami-hammy/"}
