{"name":"Dino Deck","author":"albormeha133","created":"2018-02-24","skill":"Dinosaur Kingdom","main":[{"name":"Evilswarm Salamandra","amount":1},{"name":"Black Brachios","amount":1},{"name":"Black Brachios","amount":1},{"name":"Hydrogeddon","amount":1},{"name":"Hydrogeddon","amount":1},{"name":"Hydrogeddon","amount":1},{"name":"Sergeant Electro","amount":1},{"name":"Sphere Kuriboh","amount":1},{"name":"Sabersaurus","amount":1},{"name":"Sabersaurus","amount":1},{"name":"Anti-Magic Arrows","amount":1},{"name":"Anti-Magic Arrows","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Super Rush Headlong","amount":1},{"name":"Super Rush Headlong","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Wall of Disruption","amount":1},{"name":"Wall of Disruption","amount":1}],"extra":[],"notes":[{"text":"Finally KOG. This deck has gone throughout so many tweaks. There are better dino decks than mine. I only had 1 salamandra, so I had to save it. This deck is for new people in the game like me and dont have all the cards.\r\n\r\nTips: This deck loses to mill and burn easily. Against Saffira is ok, if you dont start AMA. REZ, they start running from this deck. Against aliens, go super aggressive.\r\n\r\nWater, is annoying was running cc but the LP loss is too much, go aggresive and try to make them banish on your turn with SRH and then AMA, they cry. Archfiends, pretty easy unless they draw the perfect hand. \r\nPhoenix for me are the most annoying, my rank up duel was against Phoenix, barely beat them, they always draw a great hand against me, luckily the whole mental game worked.\r\n\r\nFor beginners and semi-beginners like me, try to figure out the time in ranked where you face more wierd decks for me was from 10pm to 12pm. Mental games are a life saver, always in the middle set the least important card and near the card a semi important card, the most important one is always near the side deck. You can also set AMA to bluff the opponent,especially against hazy and saphira. While,they are doing plays taunt them constantly it annoys them and causes them to missplay. Last thing learn the meta really good and expect the cards they play and always use the toggle.\r\n\r\nShoutout to Tekumse the dino expert, thanks to his tips and watching his duels, I got better with dinos. \r\n\r\nHope this goes to the website, thats why it has so many tips, please mods an dkayed. Thank you"}],"url":"/top-decks/february-2018/dinos/dino-deck-by-albormeha133/"}
