{
    "created-by": "superforms",
    "created-on": "2017-10-17",
    "modified-on": "",
    "active": true,
    "title": "The Hazy Guide - October Edition",
    "url": "/the-hazy-guide-october-edition",
    "image": "hazy-flame-sphynx.png",
    "sections":
    [
        {
            "title": "1 Overview",
            "level": 1,
            "blocks":
            [
                {
                    "paragraph": "Over the course of the last three months, Hazy Flame Sphynx has been at the core of
                    decks that ranged from bad gimmicks to strong tier-2 decks that could go toe-to-toe with
                    top decks. And with the October ranked season, a new meta has been brought about in
                    which Hazy thrives more than ever. In this guide I will go over various Hazy Flame builds,
                    how to construct and play the deck in the current meta, and will conclude by arguing that
                    we now have a Hazy Flame deck <b>which has pushed its way into tier-1</b>."
                },
                {
                    "layout": "wrapped",
                    "paragraph": "Before going any further: If you already have a general idea of how
                    Hazy works and are just looking for a quick run-down of how the
                    “optimal” Hazy Flame deck is built/played, check out section 2 for
                    the build + card choices and section 3.3 for quick, one-sentence tips
                    on possible plays, combos, and general things to keep in mind. If
                    you’re interested mainly in the Cyber Angel match-up, skip ahead
                    to section 3.1. For other match-ups, see section 3.2."
                },
                {
                    "paragraph": "To give a little bit of history, Hazy Flame Sphynx was introduced to the Card Trader
                    on July 5th and was immediately the cause of a lot of excitement. This was due to the
                    combination of Hazy Flame’s effect"
                },
                {
                    "layout": "quoted",
                    "paragraph": "Your opponent cannot target this card with card effects. You can declare 1 card
                    type (Monster, Spell, or Trap); send the top card of your Deck to the Graveyard,
                    then if it was the declared card type, you can Special Summon 1 FIRE monster
                    from your hand or Graveyard. You can only use this effect of “Hazy Flame
                    Sphynx” once per turn."
                },
                {
                    "paragraph": "with Mai’s long-neglected skill Aroma Strategy which allows you to always know the top
                    card of your deck. However, Hazy Flame’s skill was bugged on arrival, and would always
                    summon the leftmost monster in the list when prompted (and would always summon in
                    defense position). This forced Hazy to the sideline for quite a while as Konami attempted
                    to fix the bug."
                },
                {
                    "paragraph": "Once this was resolved there were two early Hazy Flame decks, each with a very
                    different philosophy. First was Hazy Flame control, which used Hazy’s effect to keep control
                    monsters like Sergeant Electro and Heavy Knight of the Flame on the field. Second was
                    a more clever build that used the card Beast Rising in combination with FIRE-attribute
                    Beast and Beast-Warrior monsters like Fire King Avatar Yaksha and Great Angus to 
                    create a “fat Hazy” with absurdly high ATK. We’ll discuss more up-to-date takes on both of
                    these builds soon, but at the time they were solid tier-2 decks. Control suffered from a
                    heavy back-row dependence, and the Beast Rising build could be easily disrupted by
                    Super Rush Headlong (not to mention that Yaksha and Great Angus had nothing good going
                    for them beside their Type). Furthermore, these decks were attempting to break into the
                    scene at a time when Toons (and Toon Barrel Dragon) and Red-Eyes Balance were
                    dominating the ladder. Toons punched right through Hazy’s strong front-row and Red-Eyes
                    Balance simply negated the set-up process with Champion’s Vigilance, Divine Wrath, or
                    Ultimate Providence. This season, however, things have changed drastically in Hazy’s
                    favor. Getting right down to it, let’s now talk about how to build a modern Hazy Flame
                    deck, keeping in mind the other decks gaining traction in Duel Links."
                }      
            ]
        },
        {
            "title": "1.1 Preliminary Deck-Building",
            "level": 2,
            "blocks":
            [
                {
                    "paragraph": "One of the most fun things about building a Hazy Flame deck is in the extreme
                    flexibility you have when constructing the deck. The reason why Hazy Flame decks are
                    powerful should be somewhat obvious, but revolves around their ability to effectively summon
                    monsters at will as well as be immune from any of your opponent’s targeting effects. This
                    means that any FIRE monster is fair game in a Hazy deck, from Phoenix Gearfried, to
                    Sergeant Electro, to Knight of the Red Lotus. In particular, you can adapt to the current
                    meta with relative ease by swapping tech cards or changing the entire core of the deck."
                },
                {
                    "paragraph": "This season, the ladder is dominated by Cyber Angels. An extremely strong and
                    consistent deck introduced with the GX update, Cyber Angels feature strong ritual monsters
                    with potent recycling effects. The most dangerous of the ritual monsters is Cyber Angel
                    Dakini, which gives other ritual monsters piercing damage, can recycle from the grave,
                    and — most importantly — can force you to send one of your monsters from the field to
                    the grave. This last effect is by far the most powerful because the monster removal is
                    non-destructive (so cannot be stopped by Toon Kingdom, won’t trigger Warm Worm’s effect,
                    etc.) and non-targeting (bypassing Hazy’s immunity). Furthermore, because you’re the
                    one sending the card to the grave, it is not considered an opponent’s card effect and things
                    like Samurai Skull’s effect don’t even activate. This also means that the effect doesn’t start
                    a chain, so you can’t choose the monster to send and then use it as tribute fodder for
                    Enemy Controller or banish it with Beast Rising. This ability of Dakini’s is very problematic
                    and we must adapt around it."
                },
                {
                    "paragraph": "It is not hard to imagine how Hazy Flame can mitigate Dakini’s effect, but there are
                    pitfalls to be avoided while planning the deck. <b>The most common mistake that can be
                    made while building a Hazy deck is focusing too much on plays that can be made only
                    after Hazy Flame is on the field.</b> With the speed and consistency of top-tier decks — Cyber
                    Angels, especially — getting Hazy Flame out needs to be of equal priority in your mind,
                    since it is easier said than done. However, once Hazy Flame is out on the field, we can
                    constantly summon monsters to serve as protection against Dakini’s effect forcing us to
                    get rid of our Hazy."
                },
                {
                    "paragraph": "So how do we summon Hazy? An obvious answer is Soul Exchange, but a potential
                    problem here is that without Hazy in hand, Soul Exchange is a completely dead card.
                    Additionally, we don’t particularly mind tributing to get Hazy out, since we can immediately
                    use Hazy’s effect to bring that monster right back if we like. But because of the pressure
                    Dakini puts on our front-row, we need monsters that can hop back out of the grave if need
                    be. This leads us to consider Flame Tiger (which I’ll talk more about in the following
                    section) and suggests that we should consider running a Beast Rising version of Hazy. This
                    turns out to be exactly the “optimal” Hazy Flame deck that I now want to describe. (I’ll
                    talk more about alternate Hazy decks in section 4.)"
                }
            ]
        },
        {
            "title": "2 “Optimal” Hazy Build",
            "level": 1,
            "blocks":
            [
                {
                    "paragraph": "In this Cyber Angel-dominated meta, the Hazy Flame build I consider to be optimal is the one
                    pictured below. This is a Beast Rising deck that incorporates two new monsters from Generation
                    Next: Flame Tiger and Caninetaur. Both synergize perfectly with Hazy + Beast Rising, and both have
                    beneficial effects (making them significantly better than their predecessors, Yaksha and Great Angus).
                    The spells and traps are mostly staples, adjusted for what we expect to match-up with most often, and
                    so the rest of the deck is fairly standard. However, notice that this deck does not use Aroma Strategy
                    and instead opts for Destiny Draw. While Aroma Strategy is great if you can get an early Hazy Flame
                    onto the field, this will not always happen. Furthermore, this deck has a fairly high “brick rate” with
                    Aroma Strategy given that we’re only running six non-tribute monsters. So although it’s nice to be able
                    to see the top card of your deck, too often will it be the case that you’ve bricked and you’re watching
                    the Hazy Flame on top of your deck while your opponent’s Cyber Angels are picking you apart.",
                },
                {
                    "deck":
                    {
                        "position": "left",
                        "skill": "Destiny Draw",
                        "main":
                        [
                            { "name": "Flame Tiger", "amount": "3" },
                            { "name": "Caninetaur", "amount": "3" },
                            { "name": "Hazy Flame Sphynx", "amount": "3" },
                            { "name": "Soul Exchange", "amount": "1" },
                            { "name": "Enemy Controller", "amount": "3" },
                            { "name": "Floodgate Trap Hole", "amount": "2" },
                            { "name": "Mirror Wall", "amount": "3" },
                            { "name": "Beast Rising", "amount": "2" }
                        ],
                        "extra": []
                    }
                },
                {
                    "paragraph": "By running Destiny Draw instead we fix a couple problems at once. Hands that used
                    to be bricks are now salvageable, since many bricked hands turn into great hands with the
                    addition of a single card. We can also reduce our brick rate by running less copies of Soul
                    Exchange, choosing to only have one in the deck that we can search for with Destiny Draw
                    whenever the opportunity arises."
                },
                {
                    "paragraph": "Before getting into the card choices, I want to emphasize why this particular Hazy build
                    is doing so well right now. The short answer is that Cyber Angels have driven out all of
                    Hazy Flame’s counters and even forced other top-tier decks to adjust in ways that further
                    benefit Hazy. Some of Hazy Flame’s biggest counters are decks like Toon Barrel Dragon
                    and mill, and these are both completely shut down by Cyber Angel Dakini’s effect. Ad-
                    ditionally, because people are countering Dakini’s effect through Enemy Controller (by
                    tributing their monster, taking control of Dakini, and then sending Dakini to the grave
                    by its own effect), most decks run 3x Enemy Controller. But because Enemy Controller
                    targets, Hazy Flame is immune and Enemy Controller becomes essentially useless. Even
                    better, however, is that Cyber Angels give Hazy a good reason to run 3x Enemy Controller,
                    which it has always wanted to do to help protect Hazy Flame from cards like Super Rush
                    Headlong (which only targets the monster attacking into Hazy Flame, not Hazy itself). So
                    thanks to Dakini, Hazy Flame’s standing in the meta has been raised substantially."
                },
                {
                    "paragraph": "Let’s turn now to the cards and discuss which are core cards (those that you absolutely
                    need to play the deck), which are luxury cards (those that really streamline and optimize
                    the deck), which are budget replacements (those that you can use in place of certain other
                    cards), and which are tech choices (those that could change at any moment depending on
                    what’s popular in the meta). Each of the card images can be clicked on to take you to the
                    Wikia page for that card. If you are unsure about where to find these cards in game, go to
                    the Card Catalog and use the “How to Obtain” feature."
                }               
            ]
        }
    ]
}