{"name":"\"citadel whale is overrrated and gishkis are trash\" - dkayed 2018","author":"stealth sub","created":"2018-03-08","skill":"Mythic Depths","main":[{"name":"Citadel Whale","amount":1},{"name":"Citadel Whale","amount":1},{"name":"Citadel Whale","amount":1},{"name":"Abyss Soldier","amount":1},{"name":"Abyss Soldier","amount":1},{"name":"Abyss Soldier","amount":1},{"name":"Gishki Chain","amount":1},{"name":"Gishki Chain","amount":1},{"name":"Gishki Chain","amount":1},{"name":"Gishki Beast","amount":1},{"name":"Gishki Beast","amount":1},{"name":"Gishki Ariel","amount":1},{"name":"Gishki Ariel","amount":1},{"name":"Gishki Ariel","amount":1},{"name":"A Legendary Ocean","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Sea Stealth Attack","amount":1},{"name":"Sea Stealth Attack","amount":1}],"extra":[],"notes":[{"text":"ez KOG, at least for my standards. i lost a couple times in a few promotion duels, but i didn't lose anything outside of a few fluke promotion duels so i'm feeling pretty good about that.\r\n\r\ntotal record since switching to this was like 28-4\r\n\r\nthis deck is pure consistency. if they don't run cosmic cyclone, you will summon whale, get out sea stealth attack, and win probably. if you don't draw whale you might struggle, which happened to me a lot, but even then the gishki engine is super strong and there are loads of decks in the meta (cyber angels, gladiator beasts, d heroes, phoenix) that have no real answer to you just bouncing their boss monster with abyss soldier\r\n\r\n- I wanted to run Cosmic Cyclone for the SSA mirror but I don't have it and Komoney won't give me enough gems.\r\n- Gishki Beast is sleeper great, even if you're just using him to summon a monster and econ take.\r\n- Abyss Soldier is far and away the best card in the new box. Even with the nerf erata from the TCG. It's OP. It's like if Sniper Hunter was good. The only boss monster with protection from his effect is Legendary Fisherman II\r\n- oh and you automatically take a hard L against elemental heroes"}],"url":"/top-decks/march-2018/sea-stealth-attack/-citadel-whale-is-overrrated-and-gishkis-are-trash-dkayed-2018-by-stealth-sub/"}
