{"_id":"305a8b90-134d-11e8-ac1c-19c37427ecb5","name":"Kog deck #3","deckType":"hazy-flame","skill":"Beatdown!","author":"LukeCMM","notes":"I was getting tilted so much in plat I deranked to 1 and was not ranking up with any deck tried my last KOG deck which was BR hazy but didn’t work so I built this and it got me from plat 1 to KOG, lost very little matches.\r\n\r\nI didn’t have any more tensu’s didn’t draw it much but sure it was on top when I used Sphynx lol, I put canines and flame Tiger in place of 2 tensus and a third peryton and it worked perfect, got the otk combo pretty much every game, if I didn’t I would just set raven and go on from there.\r\n\r\nThe reason this deck is good is because most people I played against in my climb always, I mean always, summoned or set a monster and then one backrow which was an easy game for me, I would lock their backrow, if I had gyokkou, and just go off by special summoning coyote then tribute summoning Peryton then getting out Sphynx and Cerberus and then using Sphynx effect, hopefully not milling one of 3 spells in the deck lol, and then summon and go for game, the maximum attack for this deck is 3300, I managed to get to 3000 and destroy slash and a bls and then end the duel with the third monster so their is massive amounts of power in this deck. \r\n\r\nA tip when dealing with tensu is that as the card states ”Beast-warrior” monster that means Peryton isn’t a valid monster to summon as an addition which is why you want to summon Cerberus first or raven so that counts as the summon for the spell then you still have a normal summon for your Peryton. Another play would be tributing hazy and then killing a card and if there is a peryton in your grave you can special summon that and use its effect, deck worked really well really consistent and got me through to KOG and stage 1.","main0":"Brotherhood of the Fire Fist - Coyote","main1":"Brotherhood of the Fire Fist - Coyote","main2":"Brotherhood of the Fire Fist - Coyote","main3":"Hazy Flame Cerbereus","main4":"Hazy Flame Cerbereus","main5":"Hazy Flame Cerbereus","main6":"Hazy Flame Sphynx","main7":"Hazy Flame Sphynx","main8":"Hazy Flame Sphynx","main9":"Flame Tiger","main10":"Hazy Flame Peryton","main11":"Hazy Flame Peryton","main12":"Caninetaur","main13":"Caninetaur","main14":"Brotherhood of the Fire Fist - Raven","main15":"Brotherhood of the Fire Fist - Raven","main16":"Brotherhood of the Fire Fist - Raven","main17":"Fire Formation - Gyokkou","main18":"Fire Formation - Gyokkou","main19":"Fire Formation - Tensu","date":"2018-02-16T19:11:28.334Z","timestamp":1518808288}