{"_id":"5c175290-1a23-11e8-82fd-bfe4ae27f572","name":"GB Deck","deckType":"gladiator-beasts","skill":"Balance","author":"ZeroPatience","notes":"It's been one hell of a season. I've been using the same deck that I used in stage 1 & 2 of the KC cup for my climb to KOG. Got cucked out of my rank-up so many times I started praying to RNGesus on a daily basis to not get trolled anymore. The deck is a standard Gladiator Beast balance build, I chose Balance over Mind Scan for semi-consistent 3 spell/trap + 1 monster starting hands because of the current anti-backrow meta (dino's, SSA, snipe hunter...) where having floodgate or wall of disruption + 2 cards that are very likely to get pinned down by Gyokkou or Xing Zhen Hu  turn one can mean the difference between winning or getting OTK'd by CA or Fire Fist Hazy. Main MVP in my last matches these past few days however was cosmic cyclone due to the huge popularity of the new SSA deck which can protect against spell/trap destruction but not against banishing. Used to run 3 WoD but switched one out for a Super Rush Headlong for that sweet dimachari + headlong combo against water decks. I kept the inpenetrable attack's at 2 in case i needed to rely on summoning Nerokius to counter water or backrow heavy decks. Nerokius completely walls SSA decks btw. I would also like to thank GB-expert Brenduke for helping me optimize this build","main0":"Gladiator Beast Laquari","main1":"Gladiator Beast Laquari","main2":"Gladiator Beast Laquari","main3":"Gladiator Beast Dimacari","main4":"Gladiator Beast Bestiari","main5":"Gladiator Beast Bestiari","main6":"Gladiator Beast Murmillo","main7":"Gladiator Beast Murmillo","main8":"Cosmic Cyclone","main9":"Enemy Controller","main10":"Enemy Controller","main11":"Enemy Controller","main12":"Super Rush Headlong","main13":"Curse of Anubis","main14":"Floodgate Trap Hole","main15":"Floodgate Trap Hole","main16":"Impenetrable Attack","main17":"Impenetrable Attack","main18":"Wall of Disruption","main19":"Wall of Disruption","extra0":"Gladiator Beast Heraklinos","extra1":"Gladiator Beast Nerokius","extra2":"Gladiator Beast Essedarii","extra3":"Gladiator Beast Essedarii","extra4":"Gladiator Beast Essedarii","date":"2018-02-25T11:59:40.945Z"}