{"_id":"62fffd80-e2f8-11e7-9323-5d20ea4b866a","name":"Gladiator Beast Deck","author":"DSPLegend","deckType":"gladiators","skill":"Mind Scan","notes":"L1 to KoG. My experiences:\r\n-I'm a big fan of 2's, except with the absolute must of 3x E-Cons. Too good of a card to run less than 3 of. Running 1 of anything else just feels wrong, but it's personal preference (back-row wise). Except for Dimacari, 3x, 2x, 2x, of the other Glad Beasts are preferred for consistency purposes.\r\n-Despite how people may feel about Dimacari, having two of them did not feel bricky at all, especially with this back-row [pro-tip, while Chalice will negate the tag-out effect of your glad beast (Click \"No\" when prompted to activate a GB effect while under Chalice or you'll lose the mosnter!), it still works wonders to get over monsters or defend against attacks and can/should be used in the damage step to surprise your opponent]. \r\n-I really wanted to like Half-Shut, but it just did not work for me. Yes, it's probably superior in most ways, and it can work in the damage step (as opposed to Impenetrable Attack) as well as combo very well with Holy Guard, but I prefer using the Mind Scan skill. Losing LP in the case that you have an attack position monster that you wish to save with Half-Shut comes with the risk of losing too much LP and thus losing Mind Scan. Do note you have to set and use Impenetrable Attack intelligently, as it can become dead vs. Ancient Gears, Mirage Dragons, and Sergeant Electro's. Same with Wall of Destruction.\r\n-MVP of the deck is definitely chalice, with WoD coming close with some clutch activations.","main0":"Gladiator Beast Heraklinos","main1":"Gladiator Beast Nerokius","main2":"Gladiator Beast Essedarii","main3":"Gladiator Beast Essedarii","main4":"Gladiator Beast Essedarii","main5":"Gladiator Beast Laquari","main6":"Gladiator Beast Laquari","main7":"Gladiator Beast Laquari","main8":"Gladiator Beast Dimacari","main9":"Gladiator Beast Dimacari","main10":"Gladiator Beast Bestiari","main11":"Gladiator Beast Bestiari","main12":"Gladiator Beast Murmillo","main13":"Gladiator Beast Murmillo","main14":"Enemy Controller","main15":"Enemy Controller","main16":"Enemy Controller","main17":"Forbidden Chalice","main18":"Forbidden Chalice","main19":"Floodgate Trap Hole","main20":"Floodgate Trap Hole","main21":"Impenetrable Attack","main22":"Impenetrable Attack","main23":"Wall of Disruption","main24":"Wall of Disruption","date":"2017-12-17T07:03:30.276Z"}