{
  "name": "Phoenix Rising",
  "author": "whynerdy1",
  "created": "2017-11-08",
  "skill": "Restart",
  "main": [
    {
      "name": "Sacred Phoenix of Nephthys",
      "amount": "3"
    },
    {
      "name": "Man-Eater Bug",
      "amount": "2"
    },
    {
      "name": "Sphere Kuriboh",
      "amount": "1"
    },
    {
      "name": "Fire King Avatar Yaksha",
      "amount": "3"
    },
    {
      "name": "D.D. Warrior",
      "amount": "1"
    },
    {
      "name": "Fire King Island",
      "amount": "3"
    },
    {
      "name": "Card Of The Soul",
      "amount": "2"
    },
    {
      "name": "Wild Tornado",
      "amount": "1"
    },
    {
      "name": "Dark Coffin",
      "amount": "2"
    },
    {
      "name": "Bottomless Shifting Sand",
      "amount": "2"
    }
  ],
  "notes":
  [
    {
      "text": "Reached KoG in 91 victories if you are curious, but number of victories is irrelevant to me because I don't start going for KoG right away (first half until 40 victories I grind for R tickets actually because I REALLY want Transmodify).
      Phoenix' relevance came down to an end when Cyber Angels hits, mainly because... it can't do anything. It has lower attack than Dakini and any removal it has in form of Wild Tornado and Dark Coffin is stopped short by MAR in the Graveyard. Now, after the banlist hits, MAR being limited means no more continous protection and the inclusion of powerful Trap cards like Wall of Disruption makes Phoenix basically stand a chance again. But Galactic Origin pack HUGELY boosts Phoenix with the inclusion of one card called Bottomless Shifting Sands
      What is Bottomless Shifting Sands? It's an Continous Trap Card with N rarity that destroys monsters with the highest Attack on the field. It can be yours or your opponent's. What made this card basically a PERFECT FIT for Phoenix decks?"
    },
    {
      "text": "1: It's a FREAKING FREE, NON-TARGETTING boss monster removal. I can't count how many times this card destroys opposing boss monsters, including AG Golem, Gladiator Beast Augustus, Dakini, Blue-Eyes, Horus lv 8, etc. This card saved me in the ass so many times to the point I'm actually questioning why it's N rarity. If there are more than 1 of the highest attack mon (2 Red-Eyes for example), this card destroys ALL of them. Your opponent have multiple Red-Eyes? This takes care them at once."
    },
    {
      "text": "2: What if your monster gets destroyed by it instead? My boss monster is Phoenix and Bottomless Shifting Sands destroys at OPPONENT's End Phase, so does it matter? No, because once your Phoenix is destroyed, you'll get it back right away next Standby Phase. This is VERY helpful when your opponent sets 2-3 backrows when phoenix is on the field and ending his/her turn, because you use this, their backrow is finished."
    },
    {
      "text": "3: It auto-destroys in your next Standby Phase if you have 4 loss cards. In this case, 100% of my matches I don't have more than 4 cards in my hand, AND when I use it, Phoenix is already destroyed by card effect, so it doesn't matter if it's destroyed next Standby Phase, because Phoenix wipes your entire backrow anyway."
    },
    {
      "text": "30% of my matches were vs Ancient Gears, other 30% vs Cybel Angels, 20% were vs Ninjas, other 20% were... others. Toons, Red-Eyes and Gladiator Beats. Worst matchup is vs Cyber Angels, but it's bearable now because you have Bottomless Shifting Sands and they no longer have MAR protection. I won 90% of my matches vs Ancient Gears and Ninjas, because they are VERY reliant on backrow. Same goes for Gladiator Beast actually, too reliant on protection cards."
    }
  ]
}