{"name":"Dino Deck","top-player-council":false,"author":"albormeha133","created":"2018-04-13","skill":"Dinosaur Kingdom","main":[{"name":"Vision HERO Witch Raider","amount":1},{"name":"Evilswarm Salamandra","amount":1},{"name":"Black Brachios","amount":1},{"name":"Black Brachios","amount":1},{"name":"Hydrogeddon","amount":1},{"name":"Hydrogeddon","amount":1},{"name":"Hydrogeddon","amount":1},{"name":"Sphere Kuriboh","amount":1},{"name":"Sabersaurus","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Forbidden Chalice","amount":1},{"name":"Memory Loss","amount":1},{"name":"Memory Loss","amount":1},{"name":"Paleozoic Canadia","amount":1},{"name":"Paleozoic Canadia","amount":1},{"name":"Swamp Mirrorer","amount":1},{"name":"Swamp Mirrorer","amount":1},{"name":"Wall of Disruption","amount":1},{"name":"Wall of Disruption","amount":1}],"extra":[],"notes":[{"text":"Yo boy got KOG with dinos hahah. Easily a Tier 3 deck. First of all shout out to @tekumse - Dino Expert and his stream, it was amazing. This deck was basically a copy paste from his deck.\r\n\r\nThis was an accidental KOG hahah, the opponent on my rank up match scooped before I did hahah. I was only testing. \r\n\r\nDeck Tweaks: I recommend a second Salamandra and a second Sphere Kuriboh, but didn't have them. Traps are ok, but maybe you can take out the canadia for something else, it was there mostly for SSA but it did put work. For spells, its your choice, do as you wish. Memory loss and the swamp were MVP for me a lot of matches, especially swamp mirror, its great in dinos. Would definitely keep it at 2.\r\n\r\nI had about 27 matches from leg1 to kog lost about 4 times. 2 times was Masked Hero, 1 was geargia and 1 Random Sylvan with stupid tech cards. With Masked Hero and geargia its almost an instant loss, they are just too strong. With Sylvans and Archfiends too easy, especially with Archfiends, they scoop immediately.\r\n\r\nThis deck requires you to be a smart player as if you duel without thinking you lose easily. For more tips check #dinos channel and ask anything  related to the deck."}],"url":"/top-decks/april-2018/dinos/dino-deck-by-albormeha133/"}
