{"name":"England is my City","author":"Ivmatterhorn","created":"2018-03-04","skill":"Balance","main":[{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Dimacari","amount":1},{"name":"Gladiator Beast Bestiari","amount":1},{"name":"Gladiator Beast Bestiari","amount":1},{"name":"Gladiator Beast Murmillo","amount":1},{"name":"Gladiator Beast Murmillo","amount":1},{"name":"Cosmic Cyclone","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Super Rush Headlong","amount":1},{"name":"Super Rush Headlong","amount":1},{"name":"Curse of Anubis","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Windstorm of Etaqua","amount":1}],"extra":[{"name":"Gladiator Beast Heraklinos","amount":1},{"name":"Gladiator Beast Nerokius","amount":1},{"name":"Gladiator Beast Essedarii","amount":1},{"name":"Gladiator Beast Essedarii","amount":1},{"name":"Gladiator Beast Essedarii","amount":1}],"notes":[{"text":"Shoutout to my city which occupies the southern half of GB. Stole this from #gladiator-tips . Why 2 Floodgate? Because I'm poor. Why 1 CC? Because I'm poor. Replaced them with Impen and Windstorm because the next best thing in the SSA matchup is to stall another turn until you can summon Batman.\r\n\r\nRoad to KoG:\r\n\r\nGame 1: BLS + Snipe Hunter - a really interesting deck. Gateway to Chaos and ritual searchers do give you +1 for Snipe Hunter fodder but don't offer much else besides a shitty beater and an inert field spell (though discarding BLS sets up SSS nicely and if three monsters get sacked Gateway goes +1 again). After dealing with his first two Snipe Hunters he unfortunately gets out his third, clears my front row and I have to stall with Econ and Windstorm until I draw another monster (unfortunately Murmillo) to kill Snipe. His Djinn-protected BLS proved to be a not-very-robust boss, as SRH can attest.\r\n\r\nGame 2: Destiny Heroes - SRHed his Dangerous and this deck ran zero backrow. He never got Celestial's draw effect off either.\r\n\r\nGame 3: Fiend Farewell Archfiends - Floodgated his Snipe Hunter, killed his Cavalry before it got to summon anything cool, Bestiari'd his Palab... basically starved him of resources.\r\n\r\nGame 4: Restart Archfiends - Don't remember how this one went tbh.\r\n\r\nGame 5: Aromages - For some reason people love to run the new The Spell Absorbing Life in Aromages and going -1. Floodgated his Bergamot and besides that he never got his board set up or got to make any plays besides WoDing me for some damage.\r\n\r\nThis deck has the tools to handle almost any deck on the ladder. Weaknesses? I went up against that new Golden Flying Fish + Oyster Meister deck twice and went 0/2."}],"url":"/top-decks/march-2018/gladiator-beasts/england-is-my-city-by-ivmatterhorn/"}
