{"name":"Best deck for ladder","author":"Snyffus","created":"2018-03-09","skill":"Balance","main":[{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Laquari","amount":1},{"name":"Gladiator Beast Dimacari","amount":1},{"name":"Gladiator Beast Bestiari","amount":1},{"name":"Gladiator Beast Bestiari","amount":1},{"name":"Gladiator Beast Murmillo","amount":1},{"name":"Gladiator Beast Murmillo","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Curse of Anubis","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Floodgate Trap Hole","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Impenetrable Attack","amount":1},{"name":"Wall of Disruption","amount":1},{"name":"Wall of Disruption","amount":1}],"extra":[{"name":"Gladiator Beast Heraklinos","amount":1},{"name":"Gladiator Beast Nerokius","amount":1},{"name":"Gladiator Beast Essedarii","amount":1},{"name":"Gladiator Beast Essedarii","amount":1},{"name":"Gladiator Beast Essedarii","amount":1}],"notes":[{"text":"The reason I played Glads is the ladder. You want to have the most well rounded deck with the least amount of bad Match-Ups. I think this is the reason why Fish is doing so well. Golden Flying Fishs effect is extremely generic making it also really good (I didnt think the deck was consistent enough).\r\nSince ladder is Best of 1 without Side you need the options in your Main Deck. Glads offer all of the ones you need with their engine making it the best choice for the ladder. Other decks are not as consistent and have more bad Match-Ups making them a worse choice. Pretty much every deck is fine because as already said, your engine can deal with everything. Stall is always a safe draw if they dont play Cards like Burning Land.\r\nYour worst Match-Up is Water. SSA counters your entire deck, best case is that they brick and you can kill them quickly with Dimacari (take risks here, you dont win a long grind game so you need to win fast). \r\nI did not play Cosmic Cyclone because I didnt want to rely on a random 2-off winning me some when it makes other Match-Ups worse because you dont draw defense. Just accept it as a bad Match-Up.\r\nAnother way to win is Batman and \r\nImpenetrable Attack helps a lot to get him out and its great against a lot of other decks as well because youre not relying on your attack getting through. Setting is a great play against Aliens because of counters.\r\nThe card is also really good and skillfull in the Mirror which is why I played 3.\r\n3 Floodgate is good against pretty much everything bc it sets them back a turn. Flying Fish and Telepath are very dangerous cards only Floodgate can deal with. Also helps a lot against Hazy.\r\n2 WoD is enough, bc then you have a good chance to draw it soon enough and dont open with too many as well. \r\nCurse of Anubis is really good because it stops all of their attacks and can be chained to stuff like Cyclone and other Backrow Removal.\r\n3 E-Con is necessary because its so versatile.\r\nRest is pretty standard."}],"url":"/top-decks/march-2018/gladiator-beasts/best-deck-for-ladder-by-snyffus/"}
