{"name":"Bujin Grass","top-player-council":false,"author":"kamikaze","created":"2018-05-24","skill":"Restart","main":[{"name":"Bujin Hirume","amount":1},{"name":"Bujin Hirume","amount":1},{"name":"Bujin Mikazuchi","amount":1},{"name":"Bujin Mikazuchi","amount":1},{"name":"Bujin Mikazuchi","amount":1},{"name":"Bujin Yamato","amount":1},{"name":"Bujin Yamato","amount":1},{"name":"Bujin Yamato","amount":1},{"name":"Bujingi Centipede","amount":1},{"name":"Bujingi Centipede","amount":1},{"name":"Bujingi Hare","amount":1},{"name":"Bujingi Hare","amount":1},{"name":"Bujingi Turtle","amount":1},{"name":"Bujin Arasuda","amount":1},{"name":"Bujin Arasuda","amount":1},{"name":"Bujingi Quilin","amount":1},{"name":"Bujingi Quilin","amount":1},{"name":"Bujingi Quilin","amount":1},{"name":"Bujingi Sinyou","amount":1},{"name":"Bujingi Sinyou","amount":1},{"name":"Dark World Dealings","amount":1},{"name":"Dark World Dealings","amount":1},{"name":"That Grass Looks Greener","amount":1},{"name":"That Grass Looks Greener","amount":1},{"name":"That Grass Looks Greener","amount":1},{"name":"Ties of the Brethren","amount":1},{"name":"Ties of the Brethren","amount":1},{"name":"Needlebug Nest","amount":1},{"name":"Needlebug Nest","amount":1},{"name":"Ultimate Providence","amount":1}],"extra":[],"notes":[{"text":"I think this is the first Bujin Deck submitted for KoG Decks. Got to KoG with a 10 win streak straight from Legend 2 to King of Games. My build is heavily focused on pulling your resources out of your deck. Which is why I have all of Ties, Dark World Dealings, Grass is Greener, and Needlebug Nest. \r\n\r\nDark World Dealings is something I havent seen many people use but it has been nice to toss a Bujingi to grave on your first turn to either trigger effects, have protection before you summon a Beast Warrior, and also to dig more into your deck for key cards. \r\n\r\nBujin Hirume is another key card that I havent seen in many Bujin builds yet and its very important to extend your plays and pressure the opponent with multiple summons in one turn, such as to get through a monster protected by a Spellbook of Fate.\r\n\r\nMy Bujingi numbers were based on what I found myself using a lot effect wise and felt good in certain matchups. I found myself using Hare more than Turtle for similar roles but decided 1 Turtle was still worth it. Quilin was by far the most used Bujin, popping both monsters and stuff like Amazoness Onslaught. The reason I have a high monster count is that I can get more value off a Grass is Greener or Needlebug due to how often I will mill them over Spells and Traps.\r\n\r\nIf I were to change much I would probably use Offerings to the Doomed or more Ultimate Providence and cut down on Mikazuchi and possibly Quilin. Powerful Rebirth is another option but, like I mentioned previously, in this build I was attempting to be more focused on pulling out my resources for the early game and as such I generally didnt have much issue in mid to late game with maintaining a Beast Warrior on board."}],"url":"/top-decks/may-2018/bujins/bujin-grass-by-kamikaze/"}
