{"name":"Naturia","author":"Shiny Sopheon F2P","created":"2018-01-25","skill":"Beatdown!","main":[{"name":"Naturia Stag Beetle","amount":1},{"name":"Naturia Stag Beetle","amount":1},{"name":"Naturia Stag Beetle","amount":1},{"name":"Naturia Hydrangea","amount":1},{"name":"Naturia Hydrangea","amount":1},{"name":"Naturia Hydrangea","amount":1},{"name":"Naturia Pumpkin","amount":1},{"name":"Naturia Pumpkin","amount":1},{"name":"Naturia Pumpkin","amount":1},{"name":"Naturia Marron","amount":1},{"name":"Naturia Marron","amount":1},{"name":"Naturia Marron","amount":1},{"name":"Naturia Pineapple","amount":1},{"name":"Anti-Magic Arrows","amount":1},{"name":"Anti-Magic Arrows","amount":1},{"name":"Anti-Magic Arrows","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Enemy Controller","amount":1},{"name":"Mirror Wall","amount":1}],"extra":[],"notes":[{"text":"I managed to reach KoG on a brand new F2P account with none other than naturias! I'm posting my proof here because I already reached KoG on my main. \r\n\r\nMy list was very \"standard\", but pineapple was definitely the mvp. It allowed me to play and win the long game much more often, instead of always relying on an \"otk\". It essentially functions as a treeborn frog that can be dumped by marron, and with 6 tribute monsters and 3 econs that is always welcome. Digging through an otherwise terrible box just to get one card may seem like a bad idea, but not including pineapple in the deck would just be handicapping yourself.\r\n\r\nThe only thing that can be changed imo is the Mirror Wall, I just happened to pull one from the selection box. Something like SRH, Windstorm, or Metalmorph can also work.\r\n\r\nI do also want to note that even after building this deck, AND getting 15 packs from the selection box, I did a few days of grinding and I already almost have a budget REZ deck complete as well. That being said I personally think the naturia route is still the best option for new players, as it's cheap and easy to use at a basic level."}],"url":"/top-decks/january-2018/naturias/naturia-by-shiny-sopheon-f2p/"}
