{
  "name": "Warriors Control",
  "author": "B-rian7",
  "created": "2017-10-25",
  "skill": "The Tie That Binds",
  "main": [
    {
      "name": "Man-Eater Bug",
      "amount": "2",
      "type": "monster"
    },
    {
      "name": "Amazoness Sage",
      "amount": "2",
      "type": "monster"
    },
    {
      "name": "Blade Knight",
      "amount": "3",
      "type": "monster"
    },
    {
      "name": "D.D. Warrior",
      "amount": "1",
      "type": "monster"
    },
    {
      "name": "Vorse Raider",
      "amount": "3",
      "type": "monster"
    },
    {
      "name": "Super Rush Headlong",
      "amount": "2",
      "type": "spell"
    },
    {
      "name": "Forbidden Chalice",
      "amount": "1",
      "type": "spell"
    },
    {
      "name": "Floodgate Trap Hole",
      "amount": "2",
      "type": "trap"
    },
    {
      "name": "Mirror Wall",
      "amount": "2",
      "type": "trap"
    },
    {
      "name": "Wall Of Disruption",
      "amount": "2",
      "type": "trap"
    }
  ],
  "notes":
  [
    {
      "title": "",
      "text": "So I just went from Legend 1 all the way to KOG in  about 22 games with Fields of the Warriors. I played against a lot of Mind Scan Cyber Angels and Balance CA. Not very much REZ. A lot of control decks, plenty of Mill, and a handful of Pheonix. Some right back at you decks showed up as well.
      
      This deck played very well against all of them, especially CA and Mill. </br>Man Eater and Sage are the star players of the deck. Clear the board with them and then use Vorse Raider or Blade Knight to swing for game. Vorse Raider is also a great way to get them to use mirror walls too early. Floodgate and Wall of D completely wreck agro decks. D.D. Warrior is a somewhat necessary card over a third Man Eater because of Pheonix, Dakini, and Zombies.
      
      </br>The biggest strength of this deck is that all of your monsters are disposable. It doesn't matter if they destroy, banish, steal, or tribute your monsters, because they are all low level with no extra summoning conditions. If they get rid of a Vorse Raider, Blade Knight will take its place. By the time Sage is removed, she has already neg'd your opponent 2. Etc.
      
      </br>The biggest weakness this deck has is Electro and Wall of D. Make sure to Floodgate Electro when he hits the field. If not, you may have to use chalice to unlock your board. If your opponent has a set spell/trap I t is usually a good idea to switch a monster to defense ,if you have a full board, before attacking. This is because if they Wall of D all your monsters to 0 Attack, you will most likely loose as you have no way to get rid of those monsters and no way to attack. Your opponent will likely just deck you out at that point.
      
      I do not recommend putting Econ or Sphere Kuriboh in this deck. The name of the game wit this deck is to exhaust your opponent's resources, not your own. 
      
      </br>I hope this deck appeals to anyone. Good luck in the KC Cup!"
    }
  ]
}